src/Catalogs/СостоянияЧатБота/СостоянияЧатБота.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СостоянияЧатБота</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>НеНайдено</name>
      <description>Не найдено</description>
    </items>
    <items>
      <name>Стоп</name>
      <description>Стоп</description>
    </items>
    <items>
      <name>Уточнение</name>
      <description>Уточнение</description>
    </items>
  </predefined>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Действие</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноИзЛюбогоСостояния</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяЗаполняемогоПараметра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПримерЗаполняемогоПараметра</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСостояния</name>
    <type>
      <types>EnumRef.ТипыСостоянийЧатБота</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевыеСлова</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Высказывание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Вложения</name>
    <attributes>
      <name>Вложение</name>
      <type>
        <types>CatalogRef.ПапкиФайлов</types>
        <types>CatalogRef.Файлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/ТипыСостоянийЧатБота/ТипыСостоянийЧатБота.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСостоянийЧатБота</name>
  <enumValues>
    <name>Высказывание</name>
  </enumValues>
  <enumValues>
    <name>Действие</name>
  </enumValues>
  <enumValues>
    <name>Вопрос</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/СостоянияЧатБота/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	КлючевыеСлова = "";
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ДополнительныеСвойства.Вставить("ЭтоНовый", Ложь);
		ПредыдущиеЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,
			"Используется, Ссылка");
	Иначе
		ДополнительныеСвойства.Вставить("ЭтоНовый", Истина);
		ПредыдущиеЗначенияРеквизитов = Новый Структура;
		ПредыдущиеЗначенияРеквизитов.Вставить("Используется", Ложь);
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ПредыдущийИспользуется", ПредыдущиеЗначенияРеквизитов.Используется);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ПредыдущийИспользуется") 
		И Используется <> ДополнительныеСвойства.ПредыдущийИспользуется Тогда 
		ОбновитьАктивностьЗависимыхСостояний(Ссылка, Родитель, Используется);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не РодительЗаданКорректно(Родитель) Тогда
		Отказ = Истина;
		ТекстПредупреждения = Нстр("ru = 'Недопустимо указывать предопределенный элемент в качестве родителя'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупреждения,, "Родитель", "Объект");
	КонецЕсли; 
	
	Если ТипСостояния = Перечисления.ТипыСостоянийЧатБота.Действие
		И Не ЗначениеЗаполнено(Действие) Тогда
		ПроверяемыеРеквизиты.Добавить("Действие");
	КонецЕсли;
	
	Если ТипСостояния = Перечисления.ТипыСостоянийЧатБота.Высказывание
		И Не ЗначениеЗаполнено(Высказывание) Тогда
		ПроверяемыеРеквизиты.Добавить("Высказывание");
	КонецЕсли;
	
	РодительТип = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родитель, "ТипСостояния");
	
	Если РодительТип = Перечисления.ТипыСостоянийЧатБота.Вопрос 
		И Не ЭтоЕдинственноеПодчиненноеСостояние(Ссылка, Родитель) Тогда
		Отказ = Истина;
		ТекстПредупреждения = НСтр("ru = 'Для типа состояния ""Вопрос"" уже задано подчиненное состояние'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупреждения,, "ТипСостояния", "Объект");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьАктивностьЗависимыхСостояний(Ссылка, Родитель, ЗначениеИспользуется)
	
	СостоянияДляОбновления = Новый ТаблицаЗначений();
	СостоянияДляОбновления.Колонки.Добавить("Ссылка");
	
	Если ЗначениеИспользуется Тогда
		Если ЗначениеЗаполнено(Родитель) Тогда 
			СостояниеДляОбновления = СостоянияДляОбновления.Добавить();
			СостояниеДляОбновления.Ссылка = Родитель;
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(Ссылка) Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СостоянияЧатБота.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.СостоянияЧатБота КАК СостоянияЧатБота
			|ГДЕ
			|	СостоянияЧатБота.Ссылка В ИЕРАРХИИ(&ТекущееСостояние)
			|	И СостоянияЧатБота.Используется = ИСТИНА
			|	И СостоянияЧатБота.Ссылка <> &ТекущееСостояние";
		Запрос.Параметры.Вставить("ТекущееСостояние", Ссылка);
		СостоянияДляОбновления = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Для Каждого Состояние Из СостоянияДляОбновления Цикл
		СостояниеОбъект = Состояние.Ссылка.ПолучитьОбъект();
		СостояниеОбъект.Используется = Используется;
		СостояниеОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция РодительЗаданКорректно(Ссылка)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Предопределенный") <> Истина;
	
КонецФункции

Функция ЭтоЕдинственноеПодчиненноеСостояние(Ссылка, Родитель)
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("Родитель", Родитель);
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(*) КАК Колво
		|ИЗ
		|	Справочник.СостоянияЧатБота КАК СостоянияЧатБота
		|ГДЕ
		|	СостоянияЧатБота.Родитель = &Родитель
		|	И СостоянияЧатБота.Ссылка <> &Ссылка
		|	И СостоянияЧатБота.ПометкаУдаления = ЛОЖЬ";
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли
